package homework_20;

// Напишите приложение, которое выводит минимальные/максимальные
// числовые значения примитивных типов: byte, short, char, int, long, float, double
// Типы как объекты String должны браться из аргументов основной функции main.
// Если в аргументах нет какого-либо типа (не указан тип), приложение должно вывести
// максимальное/минимальное значения 7 типов (byte, int, short, long, char, float, double).
// Если аргументы содержат неправильный тип, приложение должно вывести сообщение: Неверный тип.
public class Tas3 {

}
